app/controllers/customer_lists_controller.rb

  def update
    if @customer.update(line_items: (@customer.present? ? params['customer']['line_item'] : {}))
---
UPDATE `customers` SET `customers`.`updated_at` = '2022-04-22 05:31:50.945155', `customers`.`line_items` = '{\"0\"=>{\"cost\"=>\"1234\", \"budget\"=>\"Skip Tracing\", \"other\"=>\"\"}}' WHERE `customers`.`id` = 16

  def set_customer
    @customer = Customer.where(id: params[:id]).try(:first)
    unless @customer.present?
---
SELECT `customers`.* FROM `customers` WHERE `customers`.`id` = 7 ORDER BY `customers`.`id` ASC LIMIT 1
SELECT `customers`.* FROM `customers` WHERE `customers`.`id` = 17 ORDER BY `customers`.`id` ASC LIMIT 1