app/controllers/customers_controller.rb

  def index
    #@customers = Customer.all
    @customers = Customer.order(:name).page(params[:page]).per(10)
---
SELECT COUNT(*) FROM `customers`

  def create

    @customer = Customer.new(customer_params)
    if@customer.save
---
INSERT INTO `customers` (`name`, `email`, `created_at`, `updated_at`, `cost`, `budget_type`, `other_type`, `line_items`) VALUES ('Test', 't1@t.com', '2022-04-22 05:36:33.337862', '2022-04-22 05:36:33.337862', NULL, NULL, NULL, NULL)

  def update
    @customer = Customer.find(params[:id])
    if @customer.update(customer_params)
      flash[:notice] = t('customer_update_success')
      redirect_to root_path
    else
      flash[:alert] = @customer.errors.full_messages.first
---
SELECT `customers`.* FROM `customers` WHERE `customers`.`id` = 2 LIMIT 1
UPDATE `customers` SET `customers`.`name` = 'Test Customer Edit', `customers`.`email` = 'test@customer.co', `customers`.`updated_at` = '2022-04-22 11:15:43.930718' WHERE `customers`.`id` = 50
SELECT `customers`.* FROM `customers` WHERE `customers`.`id` = 11 LIMIT 1

  def destroy
    if @customer.destroy
---
DELETE FROM `customers` WHERE `customers`.`id` = 1

  def set_customer
    @customer = Customer.where(id: params[:id]).try(:first)
    unless @customer.present?
---
SELECT `customers`.* FROM `customers` WHERE `customers`.`id` = 1 ORDER BY `customers`.`id` ASC LIMIT 1
SELECT 1 AS one FROM `customers` WHERE `customers`.`id` = 5 LIMIT 1
SELECT `customers`.* FROM `customers` WHERE `customers`.`id` = 16 ORDER BY `customers`.`id` ASC LIMIT 1